{
    "title": "Rapid Review: HiroNori Craft Ramen - San Diego Magazine",
    "content": "Skip to content\nFood & Drink\nEverything SD\nThings to Do\nPodcasts & Video\nThe Magazine\nLogin\nSubscribers\nSubmit event\nSubscribe\nFood & Drink\nBest Restaurants 2024\nVote: Best of San Diego 2025 Ballot\nReviews\nFood News\nOpenings\nHappy Half Hour\nStaff Picks\nMain Dish (Newsletter)\nFeatured articles\nFood & Drink\nPezzi Del Mio Cuore Opens in Point ...\nRead article\nFood & Drink\nVegan Darling Ready to Reopen in No...\nRead article\nFood & Drink\nFirst Look: Wildflour Delicatessen ...\nRead article\nEverything SD\nArts & Culture\nLiving & Design\nHealth & Fitness\nSports\nLove & Dating\nCharitable SD\nGuides\nPartner Content\nBest of San Diego (Newsletter)\nVote: Best of San Diego 2025 Ballot\nFeatured articles\nThings to Do\n20 Hot Date Ideas to Try Across San...\nRead article\nThings to Do\nDo San Diego Hikers Need to Worry A...\nRead article\nEverything SD\nTo Talk Politics on TikTok, Users A...\nRead article\nThings to Do\nTravel\nTheatre\nMusic\nHiking\nMagazine Events\nCalendar Listings\nSan Diego Mag Insiders\nFeatured articles\nThings to Do\n20 Hot Date Ideas to Try Across San...\nRead article\nFood & Drink\nVegan Darling Ready to Reopen in No...\nRead article\nThings to Do\nDo San Diego Hikers Need to Worry A...\nRead article\nPodcasts & Video\nHappy Half Hour Podcast\nThe Plant Lady\nNot a Parenting Podcast\nVideo\nFeatured articles\npodcast-ep\nThe Story Behind San Diego's Only C...\nRead article\nvideo\nFirst Look: Wildflour Delicatessen\nRead article\npodcast-ep\nInside Oceansideâs Hottest New Re...\nRead article\nThe Magazine\nFeatures\nAbout Us\nSubscribe\nAdvertise\nCareers\nGive a Gift\nSubscriber Services\nThe Plaque Store\nFeatured articles\nThings to Do\n20 Hot Date Ideas to Try Across San...\nRead article\nFood & Drink\nRestaurant Review: Ponyboy at the P...\nRead article\nFeatures\nSan Diego Dating: What to Expect in...\nRead article\nReady to know more about San Diego?\nSubscribe\nSubscribe\nFood & Drink\nBest Restaurants 2024\nVote: Best of San Diego 2025 Ballot\nReviews\nFood News\nOpenings\nHappy Half Hour\nStaff Picks\nMain Dish (Newsletter)\nEverything SD\nArts & Culture\nLiving & Design\nHealth & Fitness\nSports\nLove & Dating\nCharitable SD\nGuides\nPartner Content\nBest of San Diego (Newsletter)\nVote: Best of San Diego 2025 Ballot\nThings to Do\nTravel\nTheatre\nMusic\nHiking\nMagazine Events\nCalendar Listings\nSan Diego Mag Insiders\nPodcasts & Video\nHappy Half Hour Podcast\nThe Plant Lady\nNot a Parenting Podcast\nVideo\nThe Magazine\nFeatures\nAbout Us\nSubscribe\nAdvertise\nCareers\nGive a Gift\nSubscriber Services\nThe Plaque Store\nReady to know more about San Diego?\nLogin\nSubscribers\nSubmit event\nSearch\nClose\nSuggestions\nFrom\nTo\nHome\nFood & Drink\nPublished\nMay 9, 2019\nRapid Review: HiroNori Craft Ramen\nYou've got to be special to survive in Hillcrest, and this shoyu is just that\nBy Troy Johnson\nTrending\nRestaurant Review: Ponyboy at the Pearl Hotel\nVegan Darling Ready to Reopen in North Park\nThe Story Behind San Diego's Only Community-Owned Grocery Co-Op\nDo San Diego Hikers Need to Worry About Mountain Lions?\n16 Things to Do in San Diego This Weekend: February 6-9\nRapid Review: HiroNori Craft Ramen\nSubscribe and get 1 year for $18\nNOTE: For restaurant reviews in\nSan Diego Magazine\n, I visit at least twice, sometimes three or four times. There are many reasons for this (a cook mightâve called in sick or hungover, staff may be moody due to personal or political reasons). “Rapid Review” is an impression of a restaurant after just one visit. Not as in-depth. But I believe it still has value. After all, most people form their impression of a restaurant after one visit.\nYou can feel the ghosts in here. Hillcrest used to be\nthe place\nfor restaurants. That was a while ago. Now it dips them in high rent and eats them alive. Restaurateurs have fled in droves to North Park, Little Italy, to the corner of Anywhere and Else.\nItâs a great, historic San Diego neighborhood and spiritual center for San Diego LGBTQ culture. It just needs a couple wins.\nCan HiroNori be that win?\nCo-owners Hiromichi Igarashi (Hiro) and Tadanori Akasako (Nori) worked at ramen joints in Japan and in the US before\nopening their own little shop in Irvine in 2017.\nIt blew up. The long lines of customers at the flagship location suggest their ramen is either second-coming caliber, or the good people of Irvine are just overjoyed that something good is happening in Irvine\n.\nÂ Now theyâve got locations in Orange County, Long Beach, and Santa Clara.\nFor their first San Diego spot, they chose a tiny storefront on Fifth Ave that formerly housed an L&L and a Naked Pizza. Like everything in this world, itâs next to a Starbucks.\nHiroNori will have to be special to survive. Reportedly their noodles and broths are made in a factory in L.A. Thatâs not encouraging. Factories in L.A. are fine for making shoes and pop stars, but “craft ramen”?\nI donât care if they craft it in an LA factory or in a drug lab. This ramenâs delicious.\nI start with their crispy chicken. Itâs not terribly crispy, but the meat is lavishly plentiful and moist. Make sure to squeeze the lemon on it (essential), and dip it in a fairly excellent spicy sauceâa thick, fresh puree tasting of habaneros. Their pork buns are fine, a little boring and a little sweet with the sauce on the pork belly, although the actual bunsâthat magical Chinese sorta-bread that tastes like a savory marshmallowâare spot on.\nI start mentally writing their obit and thenâoh god, I find it. That special thing. The reason for the lines in Irvine. If this part of the city is a vampire, the shoyu ramen is their crucifix. There are four major kinds of ramen: tonkotsu (pork), shio (salt), miso (fermented bean paste), and shoyu (soy sauce). Tonkotsu is almost\nalways\nthe main attraction at ramen shops. And HiroNoriâs tonkotsu is very nice. But shoyu is the star.\nWhat makes HiroNoriâs so special? Has to be the high quality of the soy sauce they use in their base. Ramen is all about the broth, and ramen broth is all about the baseâcalled\ntare\nin Japanese. The base is a signature blend of sauces and seasonings (usually soy, sake, mirin, garlic, miso, etc.). The tare is the heart and soul of ramen, its big bang of flavor. And HiroNoriâs tare uses a soy sauce thatâs barrel-aged for two years.\nIn the US, we basically know two kinds of soy sauceâregular, and low sodium. Thatâs like knowing “red wine and white wine.” Soy sauce can be infinitely complex depending on length of age, whether oak or steel barrels, etc. After WWII left the country with an abundance of steel, many Japanese soy sauce makers started aging in steel tanks. Something is lost with metal; wood barrels are alive, harbor beneficial microbes that develop a richer, more flavorful soy sauce. The practice of aging in wood vessels, called\nkiokeÂ\nin Japan, is making a comeback.\nI ask a HiroNori representative how theirs is aged. She refuses to spill secrets, but does send a photo of wooden barrels. I have to believe this is the secret.Â BecauseÂ whatever soy sauce HiroNori is using in their shoyu is intoxicating, deeply flavorful stuff. They mix that with chicken broth (and a little pork broth), add chashu (charred pork belly), scallions, spinach, bamboo, and kaiware sprouts. I wouldnât doctor it too much. Itâs just about perfect as is.\nI donât care if they craft it in an LA factory or in a drug lab. This ramenâs delicious.\nHiroNori Craft Ramen, 3803 Fifth Avenue, Hillcrest\nShare this post\nSubscribe to our newsletters\nBy clicking subscribe you're confirming that you agree with our Terms and Conditions.\nLatest articles\nFood & Drink\nPezzi Del Mio Cuore Opens in Point Loma\nRead article\nThings to Do\n20 Hot Date Ideas to Try Across San Diego\nRead article\nFood & Drink\nVegan Darling Ready to Reopen in North Park\nRead article\nThings to Do\nDo San Diego Hikers Need to Worry About Mountain Lions?\nRead article\nEverything SD\nTo Talk Politics on TikTok, Users Adopt a Secret Code\nRead article\nFood & Drink\nFirst Look: Wildflour Delicatessen in Liberty Station\nRead article\nThings to Do\n5 San Diego Sports Events to Watch: February 2025\nRead article\nThings to Do\n16 Things to Do in San Diego This Weekend: February 6-9\nRead article\nThings to Do\nReview: The Old Globeâs Appropriate\nRead article\nThings to Do\nWhere to Watch the Super Bowl in San Diego, 2025\nRead article\nFeatures\nWhat Does a Second Todd Gloria Term Mean for San Diego?\nRead article\nFood & Drink\nRestaurant Review: Ponyboy at the Pearl Hotel\nRead article\nSee more\nOur company\nAdvertise\nCareers\nThe Team\nContact Us\nAdvertise\nCareers\nThe Team\nContact Us\nAdvertise\nCareers\nThe Team\nContact Us\nAdvertise\nCareers\nThe Team\nContact Us\nEmail:\n[email protected]\nFacebook-f\nInstagram\nTwitter\nLinkedin\nSubscribe to our Newsletters\nSUBSCRIBE\nSubscribe\nBy clicking Subscribe you’re confirming that you agree with our Terms and Conditions.\nSubscriber services\nEmail:\n[email protected]\nPrivacy Policy\nPrivacy Policy\nPrivacy Policy\nPrivacy Policy\nÂ© Copyright 2023 San Diego Magazine 1230 Columbia Street, Suite 800, San Diego, CA\nLog in\nSign up\nContact Us\n[email protected]\nName\nEmail\nMessage\nTerms & Conditions\nSend\n1230 Columbia Street, Suite 800,\nSan Diego, CA"
}