{
    "title": "The 38 Best Orange County Restaurants - Eater LA",
    "content": "Laotian dishes from Nok’s Kitchen in Westminster.\nRon De Angelis\nThe 38 Essential Orange County Restaurants\nVibrant Laotian, hearty Vietnamese, fresh seafood, and seasonal American food in one of Southern California’s most exciting dining scenes\nby\nJenn Tanaka\nUpdated\nDec 11, 2024,  2:58pm PST\nShare this story\nShare this on Facebook\nShare this on Twitter\nShare\nAll sharing options\nShare\nAll sharing options for:\nThe 38 Essential Orange County Restaurants\nPocket\nFlipboard\nEmail\nView as Map\nLaotian dishes from Nok’s Kitchen in Westminster.\n|\nRon De Angelis\nby\nJenn Tanaka\nUpdated\nDec 11, 2024,  2:58pm PST\nShare this story\nShare this on Facebook\nShare this on Twitter\nShare\nAll sharing options\nShare\nAll sharing options for:\nThe 38 Essential Orange County Restaurants\nPocket\nFlipboard\nEmail\nOnce regarded as a secondary market to Los Angeles, Orange County’s food scene has come into its own as of late. Find mom-and-pop shops that have spent decades perfecting a singular dish in areas like Westminster, where\nVietnamese food rules\n, and along Anaheim’s\nLittle Arabia District\n. For upscale, white-tablecloth dining experiences with higher prices to match are fine dining stalwarts backed by big names. There’s something for everyone in Orange County. Here are the 38 best restaurants in Orange County.\nRead More\nEater maps are curated by editors and aim to reflect a diversity of neighborhoods, cuisines, and prices.\nLearn more about our editorial process.\nIf you buy something or book a reservation from an Eater link, Vox Media may earn a commission. See our\nethics policy\n.\nFuoco Pizzeria Napoletana\nCopy Link\nListed as one of the\nbest pizzas in America\nby the\nWashington Post\n, the pies at Fuoco Pizzeria Napoletana emerge from a nearly 1,000-degree wood-burning oven built in Naples by Stefano Ferrara. Three generations of pizzaiolos continue churning out classic margherita pizzas and the Fuoco pie, which is topped with mozzarella, prosciutto crudo, arugula, and shaved Parmigiano, and drizzled with truffle oil. A mozzarella bar is stocked weekly with cheese imported from Caserta, Italy.\n101 N Harbor Blvd, Fullerton, CA 92832\n(714) 626-0727\n(714) 626-0727\nVisit Website\nView this post on Instagram\nA post shared by Tullio Ceccarelli (@fuocopizza)\nAlso featured in:\nThe 16 Essential Pizzerias in Orange County\nKhan Saab Desi Craft Kitchen\nCopy Link\nThis Michelin-recommended halal restaurant combines the flavors of India, Afghanistan, and Pakistan with a modern Californian twist. The tender boneless chicken karahi is served with tomatoes and shishito peppers, and the butter chicken with dried fenugreek is one of the restaurant’s more popular dishes. The pani puri with tamarind water, mint, onion, and potato arrives on a mini cart and is intended to be taken as a shooter.\n229 E Commonwealth Ave Unit A, Fullerton, CA 92832\n(714) 853-1081\n(714) 853-1081\nVisit Website\nView this post on Instagram\nA post shared by Halal Indian/Pakistani Steakhouse, Restaurant + Catering in OC (@khansaab_oc)\nAlso featured in:\nSave Space for These 22 Orange County Desserts\nWhere to Order Incredible Indian and South Asian Food\nAdya\nCopy Link\nChef Shachi Mehra combines her Jersey roots and Indian heritage to create a tangy goat cheese-filled naan. The\nnew RFC sandwich\ncombines flavors of a popular Rajasthani snack, which acts as a coating for crispy fried chicken served inside a custom bun made by Dean Kim’s OC Baking Company. Mehra’s inventiveness garnered her a win on Food Network’s\nChopped\n. Meanwhile, her chef-partner, Sandeep Basrur, combines his background in traditional authentic Indian cooking to prepare classics such as a yellow shrimp coconut curry, dal makhani, and creamy cucumber raita.\nAnaheim Packing House, 440 S Anaheim Blvd Unit 201, Anaheim, CA 92805\n(714) 533-2392\n(714) 533-2392\nVisit Website\nView this post on Instagram\nA post shared by ADYA - fresh Indian flavors (@adyaoc)\nAl Baraka Restaurant\nCopy Link\nAref Shatarah and wife Magida opened Al Baraka in 2021 specializing in Palestinian dishes. Regulars tend to recommend the homestyle daily specials. Start with the sheikh el mashi, fried squash stuffed with a medley of pine nuts, peanuts and ground beef cooked in yogurt. The tender chicken and the marinated grape leaves filled with ground meat and lush verdant tabouli set Al Baraka apart in\nAnaheim’s already vibrant Little Arabia district.\n413 South Brookhurst Street, Anaheim, California 92804\n(657) 220-5296\n(657) 220-5296\nAlso featured in:\nExplore Orange County’s Little Arabia By Crawling These 10 Delicious Destinations\nKareem's Falafel\nCopy Link\nAs one of the first restaurants in Anaheim’s\nLittle Arabia District\n, Kareem’s remains a go-to for authentic Middle Eastern food. Owner Kareem Hawari’s closely held family falafel recipe is so popular that the Hawaris started selling it wholesale to grocery stores and other restaurants. The baba ganoush, grape leaves, and hummus are staples not to miss, but Kareem’s newer menu items — vegetarian wraps, falafel burgers, and feta fries — also offer a modern Mediterranean vibe without sacrificing traditional flavor.\n1208 S Brookhurst St, Anaheim, CA 92804\n(714) 215-4035\n(714) 215-4035\nVisit Website\nKareem’s Falafel.\nKareem’s Falafel\nAlso featured in:\nWhere to Eat Near Angel Stadium in Anaheim\nKatella Bakery, Deli & Restaurant\nCopy Link\nThe family-owned Los Alamitos landmark founded by Stan Ratman and his wife Shirley is known for its deli food and stocked bakery case that has black-and-white cookies, pastries such as custard-filled eclairs, chocolate chip Danishes, and rugelach. The family-sized portions allow diners to nosh on several dishes at once. Rotund matzo balls are served in Shirley’s chicken soup and rye bread pastrami sandwiches remain a Katella favorite. The vibe is family-friendly with a multi-generational crowd in the dining room, which was remodeled in 2022. The bakery section has illuminated cases filled with slices of layer cakes, cookies, and glistening fruit tarts, baskets filled with bagels, and a smattering of deli items available for takeaway.\n4470 Katella Ave (at Lexington Dr), Los Alamitos, CA 90720\n(562) 594-8611\n(562) 594-8611\nVisit Website\nView this post on Instagram\nA post shared by Katella Bakery-Deli-Restaurant (@katella_bakery)\nAlso featured in:\n17 Best Jewish Delis in Los Angeles\n18 Awesome Orange County Bakeries to Try Right Now\nSign up for the\n        \n          newsletter\nEater LA\nSign up for our newsletter.\nThanks for signing up!\nCheck your inbox for a welcome email.\nEmail\n(required)\nOops. Something went wrong. Please enter a valid email and try again.\nBy submitting your email, you agree to our\nTerms\nand\nPrivacy Notice\n. You can opt out at any time. This site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nSubscribe\nHaven Craft Kitchen + Bar\nCopy Link\nThis Old Towne Orange neighborhood hangout is known for its solid cocktail menu and well-sourced beer list compiled by owner Wil Dee. The skillet cornbread with honey butter, locally made burrata with grilled bread, and Haven’s burger prepared with Allen Bros. ground chuck, brisket and short rib, cheddar, and bibb lettuce are homestyle dishes not to miss.\nSearch for reservations\nOpenTable\n190 S Glassell St, Orange, CA 92866\n(714) 221-0680\n(714) 221-0680\nVisit Website\nMushroom toast at Haven Craft Kitchen + Bar.\nHaven Craft Kitchen + Bar\nAlso featured in:\nThe 21 Best Brunch Options in Orange County\nWhere to Eat Near Angel Stadium in Anaheim\nShootz\nCopy Link\nAt Rodeo 39 Public Market in Stanton, the bustling food hall houses some of the county’s most sought after southeast Asian bites. Beef shank-laden pho from Phoholic and Kra-Z-Kai’s Laotian-style barbecue and sticky rice. At Shootz, reimagined Hawaiian classics include a kimchi butter katsu chicken sandwich stuffed with mac salad and the honey coconut shrimp musubi.\n12885 Beach Blvd #11, Stanton, CA 90680\n(714) 379-7077\n(714) 379-7077\nVisit Website\nFried shrimp with rice and macaroni salad at Shootz in Stanton.\nWonho Frank Lee\nYigah\nCopy Link\nKorean comfort food served in large portions is what Yigah is known for in Orange County. Both the Garden Grove restaurant and its sister location in Irvine at Diamond Jamboree shopping center serve steamy galbi tang, beef short rib soup, as well as the bossam meal with boiled pork belly, napa cabbage, and spicy pickled radish.\n8562 Garden Grove Blvd, Garden Grove, CA 92844\n(657) 233-5502\n(657) 233-5502\nVisit Website\nYigah.\nYigah\nAlso featured in:\n15 Essential Korean Restaurants to Try in Orange County\nTacos Manuel\nCopy Link\nSanta Ana’s Tacos Manuel truck, open Tuesday through Sunday from 11 a.m. to 10 p.m., serves corn tortilla street tacos with carnitas, chorizo, carne asada, al pastor, and chicken. Most regulars opt for the offals, such as cabeza and tripas (tripe), served with grilled onions, jalapenos, and cilantro. The truck also makes quesadillas, tortas, and burritos, but the huaraches topped with beans, lettuce, sour cream, and meat are the most popular.\nMabury St, Santa Ana, CA 92705\n(714) 720-0889\n(714) 720-0889\nVisit Website\nView this post on Instagram\nA post shared by Best Food (@bestfood_aroundtheworld)\nAlta Baja Market\nCopy Link\nDelilah Snell’s Alta Baja Market is the heart of downtown Santa Ana. Alta Baja Market, along with 4th Street Market neighbor La Vegana Mexicana, were recipients of the 2023 Siete Family Foods’ Siete Juntos Fund, which strives to support and empower Latino communities. Alta Baja Market’s breakfast and lunch menu includes dishes such as New Mexican cornbread with honey butter and Lady C’s green chile eggchilada, which resembles a breakfast casserole using Kernel of Truth tortillas. The market’s specialty grocery section includes one of the largest selections of Mexican wines in Orange County, along with a variety of heirloom corn, beans and grains.\n201 E 4th St (at N Bush St), Santa Ana, CA 92701\n(714) 783-2252\n(714) 783-2252\nVisit Website\nView this post on Instagram\nA post shared by Alta Baja Market (@altabajamarket)\nOmakase by Gino\nCopy Link\nSushi chef Gino Choi prepares an intricate omakase for 10 diners at his namesake downtown Santa Ana restaurant. (Choi is also a self-taught carpenter who built the sushi counter, entryway, and partitions himself.) Standout dishes include a creamy Hokkaido uni udon garnished with winter black truffles from Spain; Gino’s version of tamago, flavored with shellfish; and a yuzu foam topped with slow-cooked black cod bedded alongside green plum marinated roasted tomatoes.\n304 N Main St, Santa Ana, CA 92701\n(657) 231-6008\n(657) 231-6008\nVisit Website\nNigiri at Omakase by Gino.\nJenn Tanaka\nAlso featured in:\n15 Splurge-Worthy Sushi Restaurants in Orange County\nPhoholic\nCopy Link\nThe hearty portions of Phởholic’s hot beefy pho keep Vietnamese grandparents and social media influencers returning to its original location in Westminster. Owners Gordon and Cathy Pham have opened\ntwo more locations\n, one at South Coast Plaza and another at Rodeo 39 in Stanton. Pham’s parents run the kitchen where the family’s decades-old recipe requires the broth to simmer for 14 hours. Regulars opt for the beef shank and oxtail pho on the “holic” side of the menu, but beginners can start with the steak and brisket version.\n14932 Bushard St (at Bolsa Ave), Westminster, CA 92683\n(714) 733-8822\n(714) 733-8822\nVisit Website\nVietnamese beef noodle soup at Phoholic.\nWonho Frank Lee\nNok’s Kitchen\nCopy Link\nChef Nokmaniphone Sayavong’s Laotian food built a cult following with her grilled sausage and tum mak huong, grated papaya salad mixed with tomato and seasoned with fish sauce. The herbaceous pork sausage should be eaten with sticky rice, a Laotian staple, and dipped in tangy spiced jeow som, interspersed with bites of fresh cucumber. The khao pad, her signature fried rice, comes with either tofu, chicken, pork, shrimp or crab. The restaurant recently moved to a new location on Bolsa Avenue.\n9361 Bolsa Avenue, Westminster, California 92683\n(714) 902-1338\n(714) 902-1338\nVisit Website\nDishes from Nok’s Kitchen in Westminster.\nRon De Angelis\nChaak\nCopy Link\nChaak Kitchen in Old Town Tustin is the sister restaurant to Gabbi’s Mexican Kitchen in Orange. The food pulls inspiration from Yucatán, Mayan, and European flavors. Starters such as sikil p’ak, a creamy pumpkin seed dip, and mains like the cochinita pibil, achiote smoked pork shoulder remain examples of how this lush, modern restaurant, with its retractable roof and ample sidewalk patio dining, pushes the expectations of Mexican food found in Orange County.\n215 El Camino Real, Tustin, California 92780\n(657) 699-3019\n(657) 699-3019\nVisit Website\nSikil p’ak with roasted pepita, habanero, tomatoes, and herbs.\nMax Milla\nMore in\nMaps\nThe Best Soul and Southern Food Restaurants in Los Angeles\nThe Best Splurge-Worthy Restaurants in Los Angeles\nThe Best Sushi Restaurants in Los Angeles, According to Eater Editors\nBrodard Restaurant\nCopy Link\nThis timeless restaurant offers a wide array of Vietnamese specialties, starting with 13 types of spring rolls — including the popular grilled shrimp paste with lettuce, carrots, daikon, mint, cilantro, and cucumber wrapped in rice paper. The menu continues with traditional Vietnamese noodle soups, sandwiches, and much more.\n16105 Brookhurst St, Fountain Valley, CA 92708\n(657) 247-4401\n(657) 247-4401\nVisit Website\nBrodard Chateau.\nCathy Chaplin\nAlso featured in:\nThe 23 Essential Vietnamese Restaurants in Little Saigon, Orange County\nSave Space for These 22 Orange County Desserts\nNep Cafe\nCopy Link\nNep Cafe is a\nbrunch\nsensation. At the French Vietnamese all-day cafe, run by the massively successful restaurant group\nKei Concepts\n, the kitchen pays “homage to the traditional Vietnamese morning routine.” The menu includes TikTok-worthy coffee drinks topped with salted egg yolk and delicate dishes like sous vide egg kicked up with hints of truffle. Nep’s second location in Irvine opened in the same plaza as Kei Concepts’ Sup Noodle Bar.\n10836 Warner Ave, Fountain Valley, CA 92708\n(714) 516-8121\n(714) 516-8121\nVisit Website\nNep Cafe.\nNep Cafe\nAlso featured in:\nThe 23 Essential Vietnamese Restaurants in Little Saigon, Orange County\nThe 21 Best Brunch Options in Orange County\nThe Winery Restaurant & Wine Bar\nCopy Link\nThe Winery Restaurant & Wine Bar’s country-inspired menu includes flatbreads, steaks, short ribs, and, best of all, roasted butternut squash and potato dauphinoise. The California-centric wine menu includes pours of the Boyz, a red wine blend from Paso Robles that was created and bottled by the restaurant’s three co-owners: JC Clowe, William Lewis, and chef Yvon Goetz who are nicknamed “the Boys.”\n2647 Park Ave, Tustin, CA 92782\n(714) 258-7600\n(714) 258-7600\nVisit Website\nThe Winery Restaurant & Wine Bar.\nThe Winery Restaurant & Wine Bar\nAlso featured in:\n10 Must-Try Restaurants in the La Jolla Area\nTerrace by Mix Mix\nCopy Link\nRoss Pangilinan’s Terrace by Mix Mix is known for its open-air patio and the chef’s large raviolo. The hand-rolled pasta is stuffed with a cheese-herb filling and a whole egg yolk. Other popular items include an albacore crostini on a crispy corn tostada and brioche French toast for brunch. Filipino-inspired dishes, including his adobo and lumpia, stand out as nods to Pangilinan’s roots.\n3333 Bear St #316, Costa Mesa, CA 92626\n(657) 231-6447\n(657) 231-6447\nVisit Website\nSteak and potatoes at Terrace by Mix Mix.\nTerrace by Mix Mix\nAlso featured in:\nThe 21 Best Brunch Options in Orange County\nVaca\nCopy Link\nTop Chef: All Stars’\nAmar Santana opened this sleek Spanish hideaway in 2016 inside the Segerstrom Performing Arts Center. Aged steaks hang from illuminated cases as if perched in a sleek showroom. For lunch, the lamb burger is punched up with feta, sumac onion, and red pepper jam. Those looking for paella will find options with saffron-hinted bomba rice. But the sharable tapas are the most fun. The chef’s snacks rotate often, but the creamy chicken croquettes and warm pulp with fingerling potatoes drizzled in Spanish olive oil remain mainstays since it opened.\n695 Town Center Dr (Bristol St.), Costa Mesa, CA 92626\n(714) 463-6060\n(714) 463-6060\nVisit Website\nPaella from Vaca in Costa Mesa.\nVaca\nKnife Pleat\nCopy Link\nThis modern French-Californian restaurant from chef Tony Esnault and Yassmin Sarmadi is ripe for celebratory meals. The three-course lunch and four-to-six-course dinner prix fixe menus change often. One week, it’s French black truffles; another evening, it’s a Nowruz dinner with recipes by Shamsi Katebi, prepared by Esnault and his kitchen team. Its plush banquets and round tables overlook the bar and open kitchen. A sunlit patio is typically booked with private weekend events, and a pricey but impeccable afternoon tea service is available on Saturdays. The surprisingly satisfying non-alcoholic cocktails, like the Cadillac margarita with blood orange and lime, are also worth stopping in for.\n3333 S Bristol St, Costa Mesa, CA 92626\n(714) 266-3388\n(714) 266-3388\nVisit Website\nThe dining room at Knife Pleat.\nTom Bonner\nAlso featured in:\nThe 18 Best Places for Afternoon Tea in Los Angeles\nLos Angeles’s 2024 Michelin Stars, Mapped\nPopulaire Modern Bistro\nCopy Link\nChefs Nick Weber and Ross Pangilinan\n’s modern California-French bistro is situated in South Coast Plaza, where fried chicken bites topped with caviar fit perfectly with the glitzy atmosphere. Standout starters include crispy duck “spliffs” and escargot ebelskivers; burgers nestled in homemade potato rolls and koji-marinated duck showcase Weber’s attention to detail. Populaire’s laid-back decor with black-and-white photos of Johnny Cash and Ramones album covers offset dusty pink floral wallpaper and pastel blue walls. The look echoes the food: refined with a touch of rock-and-roll.\n3333 Bristol St Suite 2601, Costa Mesa, CA 92626\n(714) 760-4555\n(714) 760-4555\nVisit Website\nBavette steak at Populaire Modern Bistro.\nRon De Angelis\nAlso featured in:\nSave Space for These 22 Orange County Desserts\nA&J Restaurant\nCopy Link\nThis Taiwanese restaurant in Irvine serves Chinese-style crispy pork chop over rice and thousand-layer pancakes, but the noodle dishes are not to be missed, including a beef noodle soup and noodles with ground pork. For diners who enjoy heat, the menu also features several Sichuan-style dishes, like a beef tendon noodle soup and spicy wontons.\n14805 Jeffrey Rd, Irvine, CA 92618\n(949) 786-3585\n(949) 786-3585\nVisit Website\nView this post on Instagram\nA post shared by A&J Restaurant (@ajrestaurant)\nAlso featured in:\nThe Best Chinese Restaurants Around D.C.\nWhere to Eat and Drink in Rockville\nHana re\nCopy Link\nThe omakase-only Hana re is a 10-seat sushi-ya helmed by Atsushi Yokoyama. Located in an industrial storage crate at the Lab in Costa Mesa, the Michelin star counter feels like a hidden gem, even though its stellar fish preparations are no secret anymore. Yokoyama and one server, who also assists with wine pairings, put out an omakase experience that includes bite sized crab perched atop eel tempura, scallops enveloped in gelee, welk shellfish with celery root, caviar and shiso. Reservations can be made via text at (714) 545-2800 for the $250 omakase.\n2930 Bristol Street, Costa Mesa, California 92626\n(714) 545-2800\n(714) 545-2800\nVisit Website\nView this post on Instagram\nA post shared by Wu Jiang (@w499340317)\nVibe Organic Kitchen & Juice\nCopy Link\nThe gluten-free, organic, and vegan cafe serves breakfast options all day. The blue-colored spirulina chia pudding with fresh fruit and tacos with handmade corn tortillas, cauliflower scramble, pico de gallo, and cashew lime crema are snackable any time of day. For vegan beginners, the cafe serves acai bowls with cacao nibs, an extensive menu of made-to-order juices and smoothies blended with homemade coconut milk, and a kid-friendly organic mixed berry waffle with cashew cream and maple syrup.\n1000 Bristol St N, Newport Beach, CA 92660\n(949) 478-4118\n(949) 478-4118\nVisit Website\nView this post on Instagram\nA post shared by Vibe Organic Kitchen & Juice (@eatdrinkvibe)\nMario's Butcher Shop\nCopy Link\nThe strip mall butcher shop and deli serves\npastrami sandwiches\nlayered with beef cured in-house on rye bread. The rotating specials board includes fish and chips, and Cuban and porchetta sandwiches. The smash burger made with beef ground in-house and the pastrami with coleslaw remain the favorites for regulars.\n1000 Bristol St N, Newport Beach, CA 92660\n(949) 316-4318\n(949) 316-4318\nVisit Website\nA pastrami sandwich from Mario’s Butcher Shop.\nFarley Elliott\nAlso featured in:\nThe 15 Best Breakfast Burritos in Orange County\nFermentation Farm\nCopy Link\nProbiotics rule at Fermentation Farm — thanks to nearly a dozen different on-tap kombucha flavors, and food options like a French onion soup with raw cheese and a kraut-filled grilled cheese sandwich. Visit on Thursdays from 11 a.m. to 2 p.m. when a farmers market featuring produce from Rosewood Farms and Sunny Cal Farms pops up in the restaurant’s parking lot. Monthly classes include an intro to bone broth and fermentation techniques like kombucha brewing. A new location opened at River Street Marketplace in San Juan Capistrano.\n1125 Victoria St Suite R, Costa Mesa, CA 92627\n(949) 650-0830\n(949) 650-0830\nVisit Website\nFermentation Farm.\nFermentation Farm\nA Restaurant\nCopy Link\nThis cozy red booth hideout on Pacific Coast Highway is known for its Rat Pack atmosphere. The classic martini reigns at the bar and the chicken pot pie is only available on Fridays, but locals love the steaks, the confited Mary’s organic chicken, and pan-seared Niman Ranch pork chops. Put simply: The restaurant is old-school done right. River Jetty Restaurant Group also operates A Restaurant’s sister locales CDM Restaurant, A Crystal Cove, and A Market, which are go-to hot spots in Newport Beach.\n3334 West Coast Hwy, Newport Beach, CA 92663\n(949) 650-6505\n(949) 650-6505\nVisit Website\nA Restaurant.\nA Restaurant\nFable & Spirit\nCopy Link\nA meal at Fable & Spirit, almost by default, starts with warm Guinness brown bread with European butter and Jacobsen sea salt. From there, the Lido Isle restaurant weaves between European meat and potato influences to pure Californicana, like citrusy salads loaded with cara cara and blood oranges, chevre, and crispy quinoa. Chef David Shofner and the Coyle family are also known for popular Mission Viejo restaurants Wineworks for Everyone and Dublin 4 Gastropub.\n3441 Via Lido, Newport Beach, CA 92663\n(949) 409-9913\n(949) 409-9913\nVisit Website\nFable & Spirit.\nFable & Spirit\nAlso featured in:\nThe 21 Best Brunch Options in Orange County\nHook and Anchor\nCopy Link\nFor first-timers, the lobster roll and creamy clam chowder at this seafood spot are a gateway experience. Bites of the buttery toasted bun stuffed with succulent claw meat are interspersed with slurps of homemade chowder with whole baby clams. The dish evokes memories of the best old-school seafood houses. Venture beyond the lobster roll: The rest of the menu includes favorites like crispy beer-battered mahi mahi fish and chips as well as wild-caught seafood for surf-and-turf plates.\n3305 Newport Blvd, Costa Mesa, CA 92663\n(949) 423-7169\n(949) 423-7169\nVisit Website\nScallops from Hook and Anchor.\nHook and Anchor\nSushi II\nCopy Link\nThe splurge-worthy Sushi II is located in Mariner’s Point in Newport Beach and offers three hyper-seasonal omakase experiences. Named after distinct Japanese pottery — Bizen, Oribe, and Karatsu — the menus range from $150 to $275 per person. At lunch, chirashi starts at $35 and omakase is $120. Order the omakase paired with sake to experience master chef Susumu Ii’s washoku training to the fullest. The takeout offerings, such as the deluxe chirashi ($48) and a classic Japanese cherry blossom chirashi for $27, are exquisitely packaged for impressive meals on the go.\n100 West Coast Hwy Suite 202, Newport Beach, CA 92663\n(949) 287-6268\n(949) 287-6268\nVisit Website\nView this post on Instagram\nA post shared by Sushi ii (@sushi_iirestaurant)\nAlso featured in:\n15 Splurge-Worthy Sushi Restaurants in Orange County\nFarmhouse at Roger's Gardens\nCopy Link\nChef Richard Mead is a long-standing figure in the Orange County dining scene. At the Farmhouse at Roger’s Gardens, the chef showcases the best that the season has to offer from the region’s many producers, which means ever-changing takes on dishes like sea scallops, as well as shrimp and mussels served in a tomato-Pernod broth with a polenta cake made from blue corn sourced from the Tehachapi Heritage Grain Project.\nSearch for reservations\nOpenTable\n2301 San Joaquin Hills Rd, Corona Del Mar, CA 92625\n(949) 640-1415\n(949) 640-1415\nVisit Website\nFarmhouse at Roger’s Gardens.\nFarmhouse at Roger’s Gardens\nAlso featured in:\nSave Space for These 22 Orange County Desserts\nThe 21 Best Brunch Options in Orange County\nMarché Moderne\nCopy Link\nFlorent and Amelia Marneu’s white tablecloth restaurant is a stalwart in the Orange County fine dining scene. The Newport Beach restaurant serves traditional French favorites such as roasted bone marrow and duck confit. Amelia’s chopped salad with French feta, cucumber, mint, and honey grapefruit vinaigrette showcases California produce. Other standout dishes include hamachi with a jalapeño-tinged mango-yuzu sorbet, rabbit confit stuffed cannelloni, and the\nrotating desserts\ncrafted by the Marneus.\n7862 Pacific Coast Hwy, Newport Beach, CA 92657\n(714) 434-7900\n(714) 434-7900\nVisit Website\nPoached lobster from Marche Moderne.\nMarche Moderne\nAlso featured in:\nSave Space for These 22 Orange County Desserts\nSelanne Steak Tavern\nCopy Link\nLaguna Beach locals love this place for its white tablecloths, award-winning wine program, and stellar steaks. The vibrant red beet ravioli stuffed with cheese is a striking starter, while delicate souffle finishes the meal. Former Anaheim Ducks hockey player and six-time Olympian Teemu Selanne is one of the restaurant’s owners, so be on the lookout for Orange County A-listers. In November 2023, Rebekah Eastman joined the kitchen as the executive pastry chef: Eastman revamped the menu and opened the adjacent bakery by Selanne with baguette sandwiches, sticky buns, browned butter chocolate chip cookies, and bang pies stuffed with seasonal fruit.\n1464 S Coast Hwy, Laguna Beach, CA 92651\n(949) 715-9881\n(949) 715-9881\nVisit Website\nSelanne Steak Tavern.\nSelanne Steak Tavern\nAlso featured in:\nSave Space for These 22 Orange County Desserts\nHeritage Barbecue\nCopy Link\nSan Juan Capistrano’s award-winning pitmaster Daniel Castillo takes barbecue to the next level with wood-smoked brisket, sausages, turkeys, ribs, chickens, and more. First-timers load up on the brisket and ribs, while regulars order pork belly banh mi sandwiches, brisket tacos prepared with La Palma tortillas, and creamy banana pudding layered with pound cake and vanilla wafer cookies. Get the charred broccoli with cheesy mornay sauce if it’s on the menu.\n31721 Camino Capistrano, San Juan Capistrano, CA 92675\nVisit Website\nHeritage Barbecue.\nJohn Troxell\nAlso featured in:\nSave Space for These 22 Orange County Desserts\n21 Road Trip-Worthy Barbecue Destinations Outside of Los Angeles\nMayfield\nCopy Link\nGeorge Barker opened Mayfield in 2020 and sparked a new dining movement in San Juan Capistrano. The food is influenced by Levantine regional flavors, with hints of North Africa, the Mediterranean, and the Middle East mixed with California. There’s a solid burger with harissa aioli at happy hour and za’atar fried chicken for dinner. For brunch, there’s avocado toast and egg sandwiches, but there are also Turkish eggs with labneh and fiery tomato shakshuka, showcasing the variety from the kitchen. The restaurant is also known for its cocktails, one of which is featured monthly and whose proceeds are given to a local cause.\n31761 Camino Capistrano, San Juan Capistrano, CA 92675\n(949) 218-5140\n(949) 218-5140\nVisit Website\nA dessert from Mayfield in San Juan Capistrano.\nMayfield\nKahani\nCopy Link\nDeep in Orange County, hidden away in the Ritz-Carlton Laguna Niguel, chef Sanjay Rawat prepares what could be the most incredible Indian fine dining that Southern California has seen. Rawat’s inventive and playful presentations don’t hold back on flavor in a venue that was previously a staid hotel steakhouse. It’s clear that Rawat and his immense wedding feasts for the property translate into something that OC diners can wrap their heads around, like the spiced Chilean sea bass with roasted delicata squash or the exceptional rack of lamb over forbidden rice and handi sauce.\n— Matthew Kang, lead editor\n1 Ritz Carlton Drive, Dana Point, California 92629\n(949) 240-2000\n(949) 240-2000\nVisit Website\nModern Indian dishes from Kahani in Dana Point’s Ritz-Carlton, Laguna Niguel hotel.\nKahani\nAlso featured in:\nThe 21 Best Indian and South Asian Restaurants in Los Angeles\nTruly Pizza\nCopy Link\nThis partnership from chef Chris Decker, Donna Baldwin, John Arena, and developer Steve Muller brings some of the best pizza in Southern California to Dana Point. Hearth-baked 12-inch American artisan pizzas like La Dolce Vita with fontina, artichoke cream, prosciutto cotto, and arugula emerge from the kitchen. But the coveted square pizzas, which are limited daily, combine the fluffy chew of focaccia with a quintessential cheese pull. The classic pepperoni is slathered with a nuanced California red sauce and topped with fresh and aged whole milk mozzarella and charred pepperoni. Save space for\nStrauss Creamery organic vanilla soft serve\nwith drizzles of chocolate sauce or sprinkles of pistachio.\n24402 Del Prado Avenue, Dana Point, California 92629\n(949) 218-8220\n(949) 218-8220\nVisit Website\nPeperoni and burrata pizza at Truly Pizza in Dana Point.\nMatthew Kang\nAlso featured in:\nThe 16 Essential Pizzerias in Orange County\nSave Space for These 22 Orange County Desserts\nMore in\nMaps\nThe Best Ramen Shops in Los Angeles\nThe Most Romantic Restaurants in Los Angeles\nThe Best Restaurants in Los Angeles’s Arts District\n© 2025\nVox Media, Inc.\nAll rights reserved."
}